-----------------------------------------------------------
-- kabot.lua
-- カボチャタワー畑収穫プログラム設定ファイル
-- @author 琴葉茜(さとうけい)
-----------------------------------------------------------
local config = {}
local kabot = {}
-------------------------------------------------------------------------------
-- 動作設定　ここから
--   方向は、[forward / up / down / right / left / back]のどれかを使ってね
-------------------------------------------------------------------------------

---------------------------------------
-- 畑1階層の高さ(ブロック)
kabot.level_height = 3

---------------------------------------
-- 畑の階数
kabot.level_count = 4

---------------------------------------
-- 上下移動の待ち時間(秒数)
kabot.interval_vertical_move = 1200

---------------------------------------
-- 燃料チェストはカボチャタワーの一番上にある？
-- trueなら収穫物チェストが一番下になる
-- falseなら逆になるよ
kabot.fuel_on_top = true

-------------------------------------------------------------------------------
-- 動作設定　ここまで
-------------------------------------------------------------------------------
config.kabot = kabot
return config
