-----------------------------------------------------------
-- kabot.lua
-- カボチャタワー lua
-- カボチャタワー畑収穫プログラム
-- @author 琴葉茜(さとうけい)
-----------------------------------------------------------
os.loadAPI('/lib/kabot_lib')

application.turtleInit('kabot')
-----------------------------------------------------------
-- プログラム引数処理
-----------------------------------------------------------
local args = { ... }
local config_path = args[1] or 'kabot_config' -- 第一引数はコンフィグファイル名や

-----------------------------------------------------------
-- コンフィグファイル読み込み
-----------------------------------------------------------
local config = application.loadConfig(config_path)

-----------------------------------------------------------
-- main
-----------------------------------------------------------
local kabot = jidokabot.new(config.kabot)

-- 実行するよ
kabot.doKabot()
