-----------------------------------------------------------
-- turtleutils.lua
-- タートルのちょっと便利？な関数周
-- @author 琴葉茜(さとうけい)
-----------------------------------------------------------

-----------------------------------------------------------
-- turtleのスロットを初期化するよ
-- つうてもいまんとこ最初のスロットを選択するだけやで
-- なんかふさわしい処理とか思いついたら追加するよ
-----------------------------------------------------------
function resetSlot()
  turtle.select(1)
end

-----------------------------------------------------------
-- 形式化されたタートル(とコンピューター)の識別文字列を返すよ
-- ID表示を統一しといたらわかりやすいかもしれんからな
-----------------------------------------------------------
function getCompName()
  local label = os.getComputerLabel()
  if not label then
    label = 'no_label' -- labelはついてないこともあるねん
  end

  return string.format('[%03d]%s',
    os.getComputerID(),
    label
  )
end
